{
  "_name_or_path": "./tinybert_model",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "cell": {},
  "classifier_dropout": null,
  "emb_size": 312,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 312,
  "id2label": {
    "0": 24,
    "1": 7,
    "2": 10,
    "3": 22,
    "4": 4,
    "5": 19,
    "6": 16,
    "7": 5,
    "8": 6,
    "9": 3,
    "10": 18,
    "11": 17,
    "12": 30,
    "13": 21,
    "14": 1,
    "15": 20,
    "16": 23,
    "17": 27,
    "18": 0,
    "19": 15,
    "20": 11,
    "21": 32,
    "22": 26,
    "23": 9,
    "24": 33,
    "25": 14,
    "26": 12,
    "27": 29,
    "28": 2,
    "29": 8,
    "30": 28,
    "31": 25,
    "32": 31,
    "33": 13
  },
  "initializer_range": 0.02,
  "intermediate_size": 1200,
  "label2id": {
    "0": 18,
    "1": 14,
    "2": 28,
    "3": 9,
    "4": 4,
    "5": 7,
    "6": 8,
    "7": 1,
    "8": 29,
    "9": 23,
    "10": 2,
    "11": 20,
    "12": 26,
    "13": 33,
    "14": 25,
    "15": 19,
    "16": 6,
    "17": 11,
    "18": 10,
    "19": 5,
    "20": 15,
    "21": 13,
    "22": 3,
    "23": 16,
    "24": 0,
    "25": 31,
    "26": 22,
    "27": 17,
    "28": 30,
    "29": 27,
    "30": 12,
    "31": 32,
    "32": 21,
    "33": 24
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 4,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "pre_trained": "",
  "problem_type": "single_label_classification",
  "structure": [],
  "torch_dtype": "float32",
  "transformers_version": "4.49.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
